/*==============================================================================
   シャドウマップ生成用 ピクセルシェーダー [shader_pixel_shadow.hlsl]
==============================================================================*/

// 入力構造体（頂点シェーダーの出力と合わせる）
struct PS_IN
{
    float4 posH : SV_POSITION;
};

//=============================================================================
// ピクセルシェーダーメイン関数
//=============================================================================
void main(PS_IN pi)
{
    // 何もしない
    // 深度値（Z値）の書き込みは自動的
    // レンダーターゲットビュー(RTV)をNULLに設定して描画
}